brew "aria2"
brew "binutils"
brew "boost"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "ffmpeg"
brew "gcc"
brew "node"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "hashcat"
brew "htop"
brew "jless"
brew "jq"
brew "llvm"
brew "minicom"
brew "mtr"
brew "nano"
brew "neovim"
brew "ninja"
brew "nmap"
brew "nvm"
brew "pstree"
brew "ripgrep"
brew "ruff"
brew "sqlmap"
brew "stow"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "viu"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "appcleaner"
cask "basictex"
cask "blender"
cask "container"
cask "copilot-cli"
cask "iina"
cask "keycastr"
cask "motrix"
cask "utm"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "swiftlang.swift-vscode"
